docs/CS/Docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-07 Mon 10:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Docker 阿里加速</a></li>
<li><a href="#orgheadline5">2. Docker 安装neo4j</a>
<ul>
<li><a href="#orgheadline2">2.1. search</a></li>
<li><a href="#orgheadline3">2.2. pull</a></li>
<li><a href="#orgheadline4">2.3. start an instance</a></li>
</ul>
</li>
<li><a href="#orgheadline6">3. Docker commands</a></li>
<li><a href="#orgheadline10">4. Docker install mongodb</a>
<ul>
<li><a href="#orgheadline7">4.1. create a container:</a></li>
<li><a href="#orgheadline8">4.2. run the interactive mongo shell:</a></li>
<li><a href="#orgheadline9">4.3. 使用mongo镜像执行mongo 命令连接到刚启动的容器,主机IP为172.17.0.1</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Docker 阿里加速</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://dev.aliyun.com/search.html?spm=5176.1971733.0.1.67788153aOGyoW">https://dev.aliyun.com/search.html?spm=5176.1971733.0.1.67788153aOGyoW</a>
</p>

<p>
<a href="https://cr.console.aliyun.com/?spm=5176.1971733.0.2.67788153k1LQf2#/accelerator">https://cr.console.aliyun.com/?spm=5176.1971733.0.2.67788153k1LQf2#/accelerator</a>
</p>

<ul class="org-ul">
<li>配置镜像加速器</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">sudo mkdir -p /etc/docker
sudo tee /etc/docker/daemon.json &lt;&lt;-<span style="color: #E6DB74;">'EOF'</span>
<span style="color: #E6DB74; font-weight: bold;">{</span>
<span style="color: #E6DB74; font-weight: bold;">  "registry-mirrors": ["https://8jnw0wgr.mirror.aliyuncs.com"]</span>
<span style="color: #E6DB74; font-weight: bold;">}</span>
<span style="color: #E6DB74; font-weight: bold;">EOF</span>
sudo systemctl daemon-reload
sudo systemctl restart docker
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> Docker 安装neo4j</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://hub.docker.com/_/neo4j/">https://hub.docker.com/_/neo4j/</a>
</p>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> search</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-shell">docker search neo4j
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> pull</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-shell">docker pull neo4j:3.3
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> start an instance</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-shell">docker run --publish=<span style="color: #AE81FF;">7474:7474</span> --publish=<span style="color: #AE81FF;">7687:7687</span> --env=<span style="color: #FD971F;">NEO4J_AUTH</span>=none --volume=$<span style="color: #FD971F;">HOME</span>/neo4j/data:/data neo4j
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> Docker commands</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>list all images</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash">docker images
</pre>
</div>
<ul class="org-ul">
<li>rm an image</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash">docker rmi image_name
</pre>
</div>
<ul class="org-ul">
<li>list the last created container</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash">docker ps -l
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">4</span> Docker install mongodb</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">4.1</span> create a container:</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-bash">docker run --name wiki -p <span style="color: #AE81FF;">27017:27017</span> -v $<span style="color: #FD971F;">PWD</span>/mongodb:/data/db -d mongo:3.2
</pre>
</div>
<p>
-p 27017:27017 :将容器的27017 端口映射到主机的27017 端口
</p>

<p>
-v $PWD/db:/data/db :将主机中当前目录下的db挂载到容器的/data/db，作为mongo数据存储目录
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">4.2</span> run the interactive mongo shell:</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-bash">docker exec -it wiki mongo
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">4.3</span> 使用mongo镜像执行mongo 命令连接到刚启动的容器,主机IP为172.17.0.1</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-bash">&#10140;  ~ docker run -it mongo:3.2 mongo --host <span style="color: #AE81FF;">172.17.0.1</span>
MongoDB shell version: <span style="color: #AE81FF;">3.2.9</span>
connecting to: <span style="color: #AE81FF;">172.17.0.1:27017/test</span>
Welcome to the MongoDB shell.
For interactive help, type <span style="color: #E6DB74;">"help"</span>.
For more comprehensive documentation, see
  http://docs.mongodb.org/
Questions? Try the support group
  http://groups.google.com/group/mongodb-user
Server has startup warnings:
<span style="color: #AE81FF;">2017-12-22T02:00:13.170+0000</span> I CONTROL  <span style="color: #AE81FF;">[</span>initandlisten<span style="color: #AE81FF;">]</span>
<span style="color: #AE81FF;">2017-12-22T02:00:13.170+0000</span> I CONTROL  <span style="color: #AE81FF;">[</span>initandlisten<span style="color: #AE81FF;">]</span> ** WARNING: /sys/kernel/mm/transparent_hugepage/enabled is <span style="color: #E6DB74;">'always'</span>.
<span style="color: #AE81FF;">2017-12-22T02:00:13.170+0000</span> I CONTROL  <span style="color: #AE81FF;">[</span>initandlisten<span style="color: #AE81FF;">]</span> **        We suggest setting it to <span style="color: #E6DB74;">'never'</span>
<span style="color: #AE81FF;">2017-12-22T02:00:13.170+0000</span> I CONTROL  <span style="color: #AE81FF;">[</span>initandlisten<span style="color: #AE81FF;">]</span>
<span style="color: #AE81FF;">2017-12-22T02:00:13.170+0000</span> I CONTROL  <span style="color: #AE81FF;">[</span>initandlisten<span style="color: #AE81FF;">]</span> ** WARNING: /sys/kernel/mm/transparent_hugepage/defrag is <span style="color: #E6DB74;">'always'</span>.
<span style="color: #AE81FF;">2017-12-22T02:00:13.170+0000</span> I CONTROL  <span style="color: #AE81FF;">[</span>initandlisten<span style="color: #AE81FF;">]</span> **        We suggest setting it to <span style="color: #E6DB74;">'never'</span>
<span style="color: #AE81FF;">2017-12-22T02:00:13.170+0000</span> I CONTROL  <span style="color: #AE81FF;">[</span>initandlisten<span style="color: #AE81FF;">]</span>
&gt;
</pre>
</div>
<ul class="org-ul">
<li>Create the system user administrator</li>
</ul>
<p>
<b>you are not allowed to create user under the local dabase.</b>
</p>
<div class="org-src-container">

<pre class="src src-mongo">&gt; use admin
&gt; db.createUser(
     {
       user: "root",
       pwd: "root",
       roles: [ { role: "userAdminAnyDatabase", db: "wiki" } ]
     }
 )
Successfully added user: {
  "user" : "root",
  "roles" : [
    {
      "role" : "userAdminAnyDatabase",
      "db" : "admin"
    }
  ]
}
</pre>
</div>
<ul class="org-ul">
<li>Create a user administrator for a single database</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongo">use records
db.createUser(
  {
    user: "wiki",
    pwd: "root",
    roles: [ { role: "readWrite", db: "local" } ]
  }
)
db.createUser(
  {
    user: "wiki",
    pwd: "root",
    roles: [ { role: "userAdmin", db: "wiki" } ]
  }
)
db.createUser(
     {
       user:"wiki",
       pwd:"root",
       roles:[{role:"root",db:"wiki"}]
     }
  )
db.createUser(
  {
    user: "wiki",
    pwd: "root",
    roles: [ { role: "userAdmin", db: "wiki" } ]
  }
)
</pre>
</div>
<ul class="org-ul">
<li>delete content of a collection</li>
</ul>
<div class="org-src-container">

<pre class="src src-nosql:mongodb">db.collection_name.remove({})
</pre>
</div>
<ul class="org-ul">
<li>验证用户</li>
</ul>
<p>
&gt;use local
&gt;db.auth('myadmin', 'secret')
</p>

<ul class="org-ul">
<li>create index</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongodb">db.collection.createIndex( { orderDate: 1 } )
</pre>
</div>

<ul class="org-ul">
<li>create a new database:</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongodb">&gt;use new_database
</pre>
</div>
<ul class="org-ul">
<li>Drop Database in MongoDB</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongodb">db.dropDatabase(); # drop currently using database
</pre>
</div>
<ul class="org-ul">
<li>Create Collection</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongodb">db.createCollection(name, options)
</pre>
</div>
<ul class="org-ul">
<li>Find All Documents in a Collection</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongodb">db.bios.find()
</pre>
</div>
<ul class="org-ul">
<li>Find Documents that Match Query Criteria</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongodb">db.products.find( { qty: { $gt: 25 } } )
</pre>
</div>
<ul class="org-ul">
<li>count</li>
</ul>
<div class="org-src-container">

<pre class="src src-mongodb">db.xueqiu.count()
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
